#+TITLE: February 6-18, 2019 (13 days)
#+AUTHOR: dgplug.org
#+EMAIL: users@lists.dgplug.org
#+PROPERTY: Effort_ALL 0 0:05 0:10 0:30 1:00 2:00 3:00 4:00
#+COLUMNS: %35ITEM %TASKID %OWNER %3PRIORITY %TODO %5ESTIMATED{+} %3ACTUAL{+}
* REPORTS
** SCRUM BOARD
#+BEGIN: block-update-board
| TODO | NEXT | IN_PROGRESS | WAITING | DONE                                                         | CANCELED |
|------+------+-------------+---------+--------------------------------------------------------------+----------|
|      |      |             |         | DEV.1549808449. Project Stacknews (2019-02-18)               |          |
|      |      |             |         | READ.1549808796. Learning How to Learn (2019-02-18)          |          |
|      |      |             |         | READ.1549896237. Emacs Bug Process (2019-02-18)              |          |
|      |      |             |         | READ.1545566270. [[https://github.com/maxogden/ (2019-02-18) |          |
|      |      |             |         | READ.1549883885. DS/Algo Foundation (2019-02-18)             |          |
|      |      |             |         | READ.1538996950. Linux for you and me (2019-02-18)           |          |
#+END:
** DEVELOPER SUMMARY
#+BEGIN: block-update-summary
| NAME             | ESTIMATED | ACTUAL | DONE | REMAINING | PENCILS DOWN | PROGRESS   |
|------------------+-----------+--------+------+-----------+--------------+------------|
| Sidntrivedi      |       3.5 |   3.36 |  3.5 |         0 |   2019-02-21 | ########## |
| Sandeepk         |        14 |  12.75 |   14 |         0 |   2019-02-21 | ########## |
| Nightwarrior-Xxx |         0 |      0 |    0 |         0 |   2019-02-21 | ---------- |
| Bhavin192        |         0 |      0 |    0 |         0 |   2019-02-21 | ---------- |
#+END:
** BURNDOWN CHART
#+BEGIN: block-update-graph

#+END:
** BURNDOWN LIST
#+PLOT: title:"Burndown" ind:1 deps:(3 4) set:"term dumb" set:"xtics scale 0.5" set:"ytics scale 0.5" file:"burndown.plt" set:"xrange [0:13]"
#+BEGIN: block-update-burndown
| DAY |       DATE | ACTUAL | IDEAL | TASKS COMPLETED                                                                                |
|-----+------------+--------+-------+------------------------------------------------------------------------------------------------|
|   1 | 2019-02-06 |  30.25 |    28 |                                                                                                |
|   2 | 2019-02-07 |  30.25 |    26 |                                                                                                |
|   3 | 2019-02-08 |  30.25 |    23 |                                                                                                |
|   4 | 2019-02-09 |  30.25 |    21 |                                                                                                |
|   5 | 2019-02-10 |  30.25 |    19 |                                                                                                |
|   6 | 2019-02-11 |  30.25 |    16 |                                                                                                |
|   7 | 2019-02-12 |  30.25 |    14 |                                                                                                |
|   8 | 2019-02-13 |  30.25 |    12 |                                                                                                |
|   9 | 2019-02-14 |  30.25 |     9 |                                                                                                |
|  10 | 2019-02-15 |  30.25 |     7 |                                                                                                |
|  11 | 2019-02-16 |  30.25 |     5 |                                                                                                |
|  12 | 2019-02-17 |  30.25 |     2 |                                                                                                |
|  13 | 2019-02-18 |  12.75 |     0 | READ.1538996950 READ.1549883885 READ.1545566270 READ.1549896237 READ.1549808796 DEV.1549808449 |
#+END:
** TASK LIST
#+BEGIN: columnview :hlines 2 :maxlevel 5 :id "TASKS"
| ITEM                        | TASKID           | OWNER       | PRIORITY | TODO | ESTIMATED | ACTUAL |
|-----------------------------+------------------+-------------+----------+------+-----------+--------|
| TASKS                       |                  |             | B        |      |     30.25 |  16.11 |
|-----------------------------+------------------+-------------+----------+------+-----------+--------|
| bhavin192                   |                  |             | B        |      |     12.75 |        |
| Learning Golang             |                  |             | B        |      |      8.75 |        |
| Chapter 12. Reflection      | READ.1549470496  | bhavin192   | B        |      |         2 |        |
| Chapter 12 Exercises        | DEV.1549470564   | bhavin192   | B        |      |      6.75 |        |
| GNU Emacs bug triaging      | OPS.1549821237   | bhavin192   | B        |      |         2 |        |
| Write blog post about Emacs | WRITE.1549821271 | bhavin192   | B        |      |         2 |        |
|-----------------------------+------------------+-------------+----------+------+-----------+--------|
| sandeepk                    |                  |             | B        |      |        14 |  12.75 |
| Project Stacknews           | DEV.1549808449   | sandeepk    | B        | DONE |         8 |   7.33 |
| Learning How to Learn       | READ.1549808796  | sandeepk    | B        | DONE |         4 |   4.00 |
| Emacs Bug Process           | READ.1549896237  | sandeepk    | B        | DONE |         2 |   1.42 |
|-----------------------------+------------------+-------------+----------+------+-----------+--------|
| sidntrivedi                 |                  |             | B        |      |       3.5 |   3.36 |
| [[https://github.com/maxogden/art-of-node/#learn-node-interactively][Art of node]]                 | READ.1545566270  | sidntrivedi | B        | DONE |      0.75 |   1.00 |
| DS/Algo Foundation          | READ.1549883885  | sidntrivedi | B        | DONE |      1.75 |   1.63 |
| Linux for you and me        | READ.1538996950  | sidntrivedi | B        | DONE |         1 |   0.73 |
#+END:
* TASKS
  :PROPERTIES:
  :ID:       TASKS
  :SPRINTLENGTH: 13
  :SPRINTSTART: <2019-02-06 Wed>
  :wpd-bhavin192: 1
  :wpd-nightwarrior-xxx: 1.2
  :wpd-sandeepk: 1.2
  :wpd-sidntrivedi: 0.5
  :END:
** bhavin192
*** Learning Golang
**** Chapter 12. Reflection [0/6]
     :PROPERTIES:
     :ESTIMATED: 2
     :ACTUAL:
     :OWNER:    bhavin192
     :ID:       READ.1549470496
     :TASKID:   READ.1549470496
     :END:
     - [ ] 12.1 Why Reflection?                      (7m)
     - [ ] 12.2 reflect.Type and reflect.Value       (15m)
     - [ ] 12.3 Display, a Recursive Value Printer   (40m)
     - [ ] 12.4 Example: Encoding S-Expressions      (25m)
     - [ ] 12.5 Setting Variables with reflect.Value (15m)
     - [ ] 12.6 Example: Decoding S-Expressions      (25m)
**** Chapter 12 Exercises [0/3]
     :PROPERTIES:
     :ESTIMATED: 6.75
     :ACTUAL:
     :OWNER:    bhavin192
     :ID:       DEV.1549470564
     :TASKID:   DEV.1549470564
     :END:
     - [ ] 12.3        (1.75h)
     - [ ] 12.4        (3h)
     - [ ] 12.6 Part I (7h)
*** GNU Emacs bug triaging
    :PROPERTIES:
    :ESTIMATED: 2
    :ACTUAL:
    :OWNER:    bhavin192
    :ID:       OPS.1549821237
    :TASKID:   OPS.1549821237
    :END:
    - [ ] [[https://debbugs.gnu.org/cgi/bugreport.cgi?bug=34268][#34268]]: wrong indentation in python mode
    - [ ] [[https://debbugs.gnu.org/cgi/bugreport.cgi?bug=34330][#34330]]: shell auto-complete cannot handle special characters
    - [ ] [[https://debbugs.gnu.org/cgi/bugreport.cgi?bug=34287][#34287]]: dired-do-rename vs. ls -R switch
    - [ ] [[https://debbugs.gnu.org/cgi/bugreport.cgi?bug=34267][#34267]]: Multiple themes in M-x customize-themes
    - [ ] [[https://debbugs.gnu.org/cgi/bugreport.cgi?bug=34397][#34397]]: completion forgets to escape "?"
*** Write blog post about Emacs
    :PROPERTIES:
    :ESTIMATED: 2
    :ACTUAL:
    :OWNER:    bhavin192
    :ID:       WRITE.1549821271
    :TASKID:   WRITE.1549821271
    :END:
** sandeepk
*** DONE Project Stacknews [2/2]
    CLOSED: [2019-02-18 Mon 23:00]
    :PROPERTIES:
    :ESTIMATED: 8
    :ACTUAL:   7.33
    :OWNER: sandeepk
    :ID: DEV.1549808449
    :TASKID: DEV.1549808449
    :END:
    :LOGBOOK:
    CLOCK: [2019-02-17 Sun 16:00]--[2019-02-17 Sun 18:00] =>  2:00
    CLOCK: [2019-02-16 Sat 18:00]--[2019-02-16 Sat 19:00] =>  1:00
    CLOCK: [2019-02-10 Sun 16:00]--[2019-02-10 Sun 17:30] =>  1:30
    CLOCK: [2019-02-09 Sat 21:00]--[2019-02-09 Sat 22:20] =>  1:20
    CLOCK: [2019-02-09 Sat 13:00]--[2019-02-09 Sat 14:30] =>  1:30
    :END:
    - [X] User Add/Delete/Password Forget (4h)
    - [X] Post Add/Delete (4h)
*** DONE Learning How to Learn [1/1]
    CLOSED: [2019-02-18 Mon 23:00]
    :PROPERTIES:
    :ESTIMATED: 4
    :ACTUAL:   4.00
    :OWNER: sandeepk
    :ID: READ.1549808796
    :TASKID: READ.1549808796
    :END:
    :LOGBOOK:
    CLOCK: [2019-02-15 Fri 20:20]--[2019-02-15 Fri 21:30] =>  1:10
    CLOCK: [2019-02-13 Wed 20:00]--[2019-02-13 Wed 21:00] =>  1:00
    CLOCK: [2019-02-08 Fri 21:00]--[2019-02-08 Fri 21:50] =>  0:50
    CLOCK: [2019-02-07 Thu 20:30]--[2019-02-07 Thu 21:30] =>  1:00
    :END:
    - [X] Renaissance Learning and Unlocking Your Potential (4h)
*** DONE Emacs Bug Process [2/2]
    CLOSED: [2019-02-18 Mon 23:00]
    :PROPERTIES:
    :ESTIMATED: 2
    :ACTUAL:   1.42
    :OWNER: sandeepk
    :ID: READ.1549896237
    :TASKID: READ.1549896237
    :END:
    :LOGBOOK:
    CLOCK: [2019-02-17 Sun 12:00]--[2019-02-17 Sun 12:45] =>  0:45
    CLOCK: [2019-02-15 Fri 17:30]--[2019-02-15 Fri 18:10] =>  0:40
    :END:
    - [X] https://debbugs.gnu.org/server-control.html (1h)
    - [X] https://debbugs.gnu.org/server-request.html#introduction (1h)
** sidntrivedi
*** DONE [[https://github.com/maxogden/art-of-node/#learn-node-interactively][Art of node]]
    CLOSED: [2019-02-18 Mon 23:00]
    :PROPERTIES:
    :ESTIMATED: 0.75
    :ACTUAL:   1.00
    :OWNER: sidntrivedi
    :ID: READ.1545566270
    :TASKID: READ.1545566270
    :END:      
    :LOGBOOK:  
    CLOCK: [2019-02-18 Mon 19:55]--[2019-02-18 Mon 20:00] =>  0:05
    CLOCK: [2019-02-18 Mon 22:05]--[2019-02-18 Mon 23:00] =>  0:55
    :END:      
    - [X] Understanding Node
*** DONE DS/Algo Foundation
    CLOSED: [2019-02-18 Mon 23:00]
    :PROPERTIES:
    :ESTIMATED: 1.75
    :ACTUAL:   1.63
    :OWNER: sidntrivedi
    :ID: READ.1549883885
    :TASKID: READ.1549883885
    :END:      
    :LOGBOOK:  
    CLOCK: [2019-02-17 Sun 12:39]--[2019-02-17 Sun 13:16] =>  0:37
    CLOCK: [2019-02-14 Thu 19:17]--[2019-02-14 Thu 20:18] =>  1:01
    :END:      
    - [X] Asymptotic analysis (Big-O notation)
*** DONE Linux for you and me
    CLOSED: [2019-02-18 Mon 23:00]
    :PROPERTIES:
    :ESTIMATED: 1
    :ACTUAL:   0.73
    :OWNER: sidntrivedi
    :ID: READ.1538996950
    :TASKID: READ.1538996950
    :END:      
    :LOGBOOK:
    CLOCK: [2019-02-18 Mon 23:10]--[2019-02-18 Mon 23:54] =>  0:0
    :END:      
    - [X] File Permissions	()
      
